import '../models/composition.dart';

List<Composition> botevCompositionsList() {
  return [
    Composition(
        id: 1,
        name: "Майце си",
        genre: "Елегия",
        artisticShapes: ["Лирическият аз", "Майката", "Смъртта"],
        mainSubject:
            "Страданието на самотния и неразбран млад човек в търсенето на лична свобода"),
    Composition(
      id: 2,
      name: "Към брата си",
      genre: "Елегия",
      artisticShapes: ["Лирическият аз", "Братът"],
      mainSubject: "Призив към революционна борба",
    ),
    Composition(
      id: 3,
      name: "Елегия",
      genre: "Елегия",
      artisticShapes: ["Лирическият аз", "Окови", "Люлки", "Кръстът"],
      mainSubject:
          "Истината за лицемерието покорството и пасивността на народа",
    ),
    Composition(
      id: 4,
      name: "Борба",
      genre: "Стихотворение",
      artisticShapes: ["Лирическият аз", "Соломон", "Врагът"],
      mainSubject: "Свободата като свръхценност",
    ),
    Composition(
      id: 5,
      name: "До моето първо либе",
      genre: "Поема",
      artisticShapes: ["Лирическият аз", "Либето", "Песента", "Пътят и гората"],
      mainSubject: "Изборът на достойно човешко поведение",
    ),
    Composition(
        id: 6,
        name: "На прощаване",
        genre: "Поема",
        artisticShapes: [
          "Лирическият аз",
          "Майката",
          "Либето",
          "Родината",
          "Дунава"
        ],
        mainSubject:
            "Раздялата в името на дълга пред отечеството и възможната смърт по пътя към свободата"),
    Composition(
        id: 7,
        name: "Хаджи Димитър",
        genre: "Балада",
        artisticShapes: [
          "Хаджи Димитър",
          "Лирическия говорител",
          "Слънцето и звездите",
          "Песента",
          "Въджът",
          "Соколът",
          "Самодивите",
          "Природата"
        ],
        mainSubject: "Пътят към безсмъртието"),
    Composition(
      id: 8,
      name: "Моята молитва",
      genre: "Стихотворение",
      artisticShapes: ["Лирическият аз", "Бог"],
      mainSubject: "Личностният Бог - истинският покривител на свободата",
    ),
    Composition(
        id: 9,
        name: "Обесването на Васил Левски",
        genre: "Елегия",
        artisticShapes: [
          "Лирическия говорител",
          "Песента на Балкана",
          "Отечеството",
          "Плачът",
          "Полето",
          "Смъртта",
          "Бесилото",
          "Зловещето развитие"
        ],
        mainSubject:
            "Непримиримата скръб на родината пред смъртта на Апостола"),
  ];
}
