import '../models/composition.dart';

List<Composition> dalchevCompositionsList() {
  return [
    Composition(
        id: 1,
        name: 'Стаята',
        genre: 'Стихотворение',
        artisticShapes: [
          'Стаята',
          'Огледалото - символ на прозрението',
          'Спрелият часовник',
          'Портрети',
          'Прах',
          'Есенно слънце',
          'Махалото',
          'Стената',
          'Заключената врата'
        ],
        mainSubject:
            'Условността а съществуването и завръщането към един отминал свят'),
    Composition(
        id: 2,
        name: 'Болница',
        genre: 'Стихотворение',
        mainSubject: 'Човешкия живот като път към смъртта',
        artisticShapes: [
          'Прозорците',
          'Часовникът',
          'Белите Стени',
          'Белите легла',
          'Есента'
        ]),
    Composition(
      id: 3,
      name: 'Прозорец',
      genre: 'Стихотворение',
      mainSubject:
          'красотата и детската чистота са илюзия, възможна само в света на въображението',
      artisticShapes: [
        'Прозорецът',
        'Децата',
        'Сребърната гора',
        'Въображението'
      ],
    ),
    Composition(
      id: 4,
      name: 'Къщата',
      genre: 'Стихотворение',
      mainSubject:
          'Липсващите връзки на самотника със заобикалящия го свят и невъзможността къщата да се превърне в дом ',
      artisticShapes: [
        'Лирическият аз',
        'Черната сянка',
        'Мъртвият',
        'Мрака',
        'Вятърът',
        'Вратата'
      ],
    ),
    Composition(
        id: 5,
        name: 'Повест',
        genre: 'Стихотворение',
        mainSubject: 'Проблема за неизживяния живот',
        artisticShapes: [
          'Къщата',
          'Портретите',
          'Часовникът',
          'Огледалото',
          'Лирическият аз'
        ]),
    Composition(
      id: 6,
      name: 'Книгите',
      genre: 'Стихотворение',
      mainSubject:
          'Книгата като възможност човека да съзерцава, но същевременно и да отнемат чистотата на емоциите и изживяването на чувствата',
      artisticShapes: ['Денят', 'Нощта', 'Книгите'],
    ),
    Composition(
      id: 7,
      name: 'Камък',
      genre: 'Стихотворение',
      mainSubject: '"Завистта" на тленния човек към вечния предмет',
      artisticShapes: [
        'Камъкът, боговоете, Плътта',
        'Есента',
        'Лятото',
        'Гранитът'
      ],
    ),
    Composition(
        id: 8,
        name: 'Дяволско',
        genre: 'Стихотворение',
        mainSubject: 'Отчуждението и невъзможността за комуникация с хората.',
        artisticShapes: [
          'Часовникът',
          '12-те кръга',
          'Небосводът',
          'Ченият цвят',
          'Прозорецът'
        ]),
  ];
}
