import '../models/composition.dart';

List<Composition> debelqnovCompositionsList() {
  return [
    Composition(
        id: 1,
        name: 'Черна песен',
        genre: 'Елегия',
        mainSubject:
            'Противоречията като разрушители, превръщаши човешкото съществуване в "живот неживян"',
        artisticShapes: [
          'Песента и душата',
          'Тъмното море',
          'Денят и нощта',
          'Зората и лъчите',
          'Пустинята'
        ]),
    Composition(
      id: 2,
      name: 'Пловдив',
      genre: 'Сонет',
      mainSubject: 'Самотата и неизменимото присъствие на скръбта в живота',
      artisticShapes: ['Градът', 'Бурята', 'Лирическият говорител'],
    ),
    Composition(
      id: 3,
      name: 'Да се завърнеш',
      genre: 'Елегия',
      mainSubject:
          'Елегия на завръщането - липсата на морални морални устои, ценностите и вярата в тях',
      artisticShapes: [
        'Печалният странник',
        'Майката',
        'Старата икона',
        'Дворът и прагът',
        'Бащината къща'
      ],
    ),
    Composition(
        id: 4,
        name: 'Помниш ли',
        genre: 'Елегия',
        mainSubject:
            'Сблъсъкът между светът на миналото и този на ностоящето - спомен и реалност',
        artisticShapes: [
          'Домът',
          'Лирическият герой',
          'Мрачният затвор',
          'Сънят',
          'Хорът на ангели',
        ]),
    Composition(
        id: 5,
        name: 'Спи градът',
        genre: 'Елегия',
        mainSubject:
            'Пропуснатата възможност да осъществиш себе си, чрез другия',
        artisticShapes: ['Нощта', 'Градът', 'Верният рицар', 'Дъждът']),
    Composition(
      id: 6,
      name: 'Миг',
      genre: 'Елегия',
      mainSubject:
          'Мигът на пропуснатото откровение, на очакваната среща с Духа',
      artisticShapes: ['Тълпата', 'Градът', 'Небето'],
    ),
    Composition(
        id: 7,
        name: 'Един убит',
        genre: 'Стихотворение',
        artisticShapes: ['Слогът', 'Майката', 'Мъртвия враг'],
        mainSubject:
            'екзистенциален опит по отношение на смъртта – сливане със земята'),
    Composition(
        id: 8,
        name: 'Сиротна песен',
        genre: 'Елегия',
        artisticShapes: ['Сиракът', 'Несретникът', 'Бездомникът'],
        mainSubject:
            'Смирението, произтичащо от осъзнавнето на смъртта като самопостигане'),
    Composition(
        id: 9,
        name: 'Тиха победа',
        genre: 'Стихотворение',
        mainSubject: 'Войната изживяна като среща със смъртта',
        artisticShapes: ['Лирическия аз'])
  ];
}
