import '../models/composition.dart';

List<Composition> pelinCompositionsList() {
  return [
    Composition(
        id: 1,
        name: 'Ветрената мелница',
        genre: 'разказ',
        mainSubject:
            'Спонтанноста и непостоянството като проява на природното у човека, което не бива да бъде потискано',
        artisticShapes: [
          'Лазар',
          'Христина',
          'Дъбака',
          'Дядо Коран',
        ]),
    Composition(
        id: 2,
        name: 'Косачи',
        genre: 'Разказ',
        artisticShapes: ['Лазо', 'Благолажа', 'Стамо'],
        mainSubject: 'Преобразяващия се под въздействие на словото човек'),
    Composition(
        id: 3,
        name: 'Задушница',
        genre: 'Разказ',
        mainSubject:
            'Връзката между личността и колектива в патриархалния свят',
        artisticShapes: ['Станчо, Стойка']),
    Composition(
      id: 4,
      name: 'Мечтатели',
      genre: 'Разказ',
      artisticShapes: [
        'Чичо Горан',
        'Рустем',
        'Скритото черковно имане',
        'Бялата куковица',
        'Ахима',
        'Селският доктор'
      ],
      mainSubject: 'Всекидневната реалност и светът на мечтите',
    ),
    Composition(
      id: 5,
      name: 'На оня свят',
      genre: 'Разказ',
      artisticShapes: ['Дядо Матейко', 'Раят'],
      mainSubject: 'Жизнеутвърждаващата философия на сиромашката душа',
    ),
    Composition(
      id: 6,
      name: 'Андрешко',
      genre: 'Разказ',
      artisticShapes: ['Андрешко', 'Бирникът', 'Съдия-изпълнителят'],
      mainSubject: 'Невъзможният диалог между държавата и хората',
    ),
    Composition(
        id: 7,
        name: 'Чорба от греховете на отец Никодим',
        artisticShapes: ['Отец Никодим', 'Отец Сисой'],
        genre: 'Разказ',
        mainSubject: 'Двуединството на греха и светостта в човешката душа'),
    Composition(
      id: 8,
      name: 'Занемелите камбани',
      genre: 'Разказ',
      mainSubject:
          'Противопоставянето между формалния ред и нуждите на страдащия човек',
      artisticShapes: ['Отец Йоаким', 'Майката на болното дете'],
    ),
    Composition(
        id: 9,
        name: 'Гераците',
        genre: 'Повест',
        mainSubject: '',
        artisticShapes: [
          'Йордан Герака',
          'баба Марта',
          'Петър',
          'Павел',
          'Елка',
          'Захаринчо',
          'Божаница',
          'Петровица',
          'Маргалака'
        ]),
  ];
}
