import '../models/composition.dart';

List<Composition> qvorovCompositions() {
  return [
    Composition(
        id: 1,
        name: 'Градушка',
        genre: 'поема',
        mainSubject: 'Прокълността на човека в един лишен от хармония свят',
        artisticShapes: [
          'Разказвачът',
          'Селяните',
        ]),
    Composition(
      id: 2,
      name: 'Заточеници',
      genre: 'Елегия',
      artisticShapes: ['Осъдените заточеници', 'Образите на родното'],
      mainSubject:
          'Мотивите за пътя и слепотата свързани с трагичното осъзнаване на отредената участ',
    ),
    Composition(
        id: 3,
        name: 'Ще бъдеш в бяло',
        artisticShapes: ['Любимата - Невестата дева', 'Лирическият аз'],
        genre: 'Стихотворение',
        mainSubject: 'Любовта и духовното спасение на човека чрез нея'),
    Composition(
      id: 4,
      name: 'Две хубави очи',
      artisticShapes: ['Любимата', 'Очите', 'Душата'],
      genre: 'Стихотворение',
      mainSubject:
          'Отрицание и едновременно с това утвърждаване на изговорения свят',
    ),
    Composition(
        id: 5,
        name: 'Стон / На Лора',
        artisticShapes: ['Лирическият аз', 'Любимата', 'Призракът'],
        genre: 'Стихотворение',
        mainSubject:
            'Привличането на мъжа към жената като емоционално противоречиво състояние - предчуствие за ново начало, но и предусещане за страдание'),
    Composition(
        id: 6,
        name: 'Сенки',
        genre: 'Стихотворение',
        artisticShapes: ['Нощта', 'Сенките на мъж и на жена', 'Лирическият аз'],
        mainSubject: 'Човека в стремежа му да намери път към другия'),
    Composition(
        id: 7,
        name: 'Песента на човека',
        genre: 'Стихотворение',
        mainSubject:
            'Човешкото присъствие в света като вечно движение, препределено от търсенето на идеалната хармония',
        artisticShapes: ['Лирическият аз']),
    Composition(
      id: 8,
      name: 'Две души',
      artisticShapes: ['Лирическият аз'],
      genre: 'Стихотворение',
      mainSubject:
          "'Човека свят', който е арена на битката между Бога и сатаната",
    ),
    Composition(
        id: 9,
        name: 'Маска',
        genre: 'Стихотворение',
        artisticShapes: [
          'Самотния мислител',
          'Вакханката',
          'Тълпата',
          'Градът'
        ],
        mainSubject:
            'Непостижимостта на абсолютното познание и страданието, причинено от търсещата мисъл'),
  ];
}
