import '../models/composition.dart';

List<Composition> smirnenskiCompositionsList() {
  return [
   Composition(
     id: 1,
     name: 'Ний',
     mainSubject: 'Глобалната метафора за майката земя и нейните непризнати чеда',
     genre: 'Стихотворение',
     artisticShapes: ['Лирическия аз', 'Огън'],
   ),
   Composition(
     id: 2,
     name: 'Юноша',
     genre: 'Стихотворение',
     artisticShapes: ['Златният телец', 'Тръненият венец', 'Надеждата', 'Разочарованието', 'Решението'],
     mainSubject: 'Необратимата духовна промяна у младия човек',

   ),
   Composition(
     id: 3,
     name: 'Йохан',
     genre: 'Поема',
     mainSubject: 'Образът на революцията на фона на личната трагедия',
     artisticShapes: ['Жената', 'Детето', 'Дървения праг', 'Барикадата', 'Малката градинка', 'Смъртта'],
   ),
   Composition(
     id: 4,
     name: 'Да бъде ден',
     genre: 'Стихотворение',
     mainSubject: 'Подземното царство, чийто обитатели жадуват да излязат на белия свят и да заживеят истински бивот',
     artisticShapes: ['Мрак', 'Тълпи', 'Смъртта', 'Кръст', 'Златния бог']
   ),
   Composition(
     id: 5,
     name: 'Цветарка',
     genre: 'Елегия',
     mainSubject: 'Поругаването на красотата и образа на града чудовище, който дебне своите обитатели, за да  разбие съдбите им.',
     artisticShapes: ['Витоша', 'Маскарадът', 'Тълпата', 'Улицата'],
   ),
   Composition(
     id: 6,
     name: 'Зимни вечери',
     genre: 'Поетически цикъл',
     mainSubject: '',
     artisticShapes: [ 'Лирическия говорител', 'Детето', 'Цветята върху прозореца', 'Небето',]
   ),
   Composition(
     id: 7,
     name: 'Стария музикант',
     genre: 'Елегия',
     mainSubject: 'Края на един живот, на една мелодия, оказали се ненужни в света, загърбил красотата и замръзнал в зимата на отчуждението',
     artisticShapes: ['Старецът', 'Бездушната тълпа', 'Мъглата на смъртта', 'Моста - топос с гранична екзистенциална ситуация', 'Плачът', 'Зимните вихри', 'Душата']
   ),
  ];
}
