import '../models/composition.dart';

List<Composition> vazovCompositionsList() {
  return [
    Composition(
        id: 1,
        name: "Българският език", 
        genre: "Ода",
        mainSubject:  "Възторжена възхвала на българския език и отхвърляне на рутателството",
        artisticShapes: ["Лирически аз", "Езикът", "Ругателите", "Родината"],
        text: "Език свещен на моите деди \n език на мъки, стонове вековни, \n език на тая, дето ни родиза радост не - за ядове отровни.\nЕзик прекрасен, кой те не ругаи кой те пощади от хули гадки?Вслушал ли се е някой досегав мелодьята на твойте звуци сладки?Разбра ли някой колко хубост, мощсе крий в речта ти гъвкава, звънлива -от руйни тонове какъв разкош,какъв размах и изразитост жива?Не, ти падна под общия позор,охулен, опетнен със думи кални:и чуждите, и нашите, във хор,отрекоха те, о, език страдални!Не си можал да въплътиш във тебсъзданьята на творческата мисъл!И не за песен геният ти слеп -за груб брътвеж те само бил орисал!Тъй слушам сè, откак съм на света!Сè туй ругателство ужасно, модно,\nсè тоя отзив, низка клевета,\nщо слетя всичко мило нам и родно.\nОх, аз ще взема черния ти срам\nи той ще стане мойто вдъхновенье,\nи в светли звукове ще те предам\nна бъдещото бодро поколенье;\nох, аз ще те обриша от калта\nи в твоя чистий бляск ще те покажа,\nи с удара на твойта красота\nаз хулниците твои ще накажа.\nПловдив, 1883\n"
        ),

    Composition(
      id: 2,
      name: "Отечество любимо",
      genre: "Ода",
      mainSubject: "Красотата на отечеството",
      artisticShapes: ["Лирически говорител", "Отечество", "Следосвобожденски човек"],

    ),
    Composition(
      id: 3,
      name: "При Рилския манастир",
      genre: "Ода",
      artisticShapes: ["Лирически аз", "Природата"],
      mainSubject: "Природата - свещен хвам за душата",
    ),
    Composition(
      id: 4,
      name: "Елате ни вижте",
      genre: "Гражданска елегия",
      mainSubject: "Голямото разочарование от следосвобожденската действителност",
      artisticShapes: ["Лирическият аз", "Тънещите в мизерия и забрава"],

    ),
    Composition(
      id: 5,
      name: "Линее нашто поколение",
      genre: "Гражданска елегия",
      mainSubject: "Горчивата равносметка за изгубения възрожденски идеализъм, за покрусените надежди, че свободата??",
      artisticShapes: ["Лирически говорител", "Лампата на Божия олтар", "Звездата на моряка"],
      
    )
      
        

   
  ];
}
