import '../models/composition.dart';

List<Composition> vazovCompositionsList() {
  return [
    Composition(
      id: 1,
      name: "Българският език",
      genre: "Ода",
      mainSubject:
          "Възторжена възхвала на българския език и отхвърляне на рутателството",
      artisticShapes: ["Лирически аз", "Езикът", "Ругателите", "Родината"],
    ),
    Composition(
      id: 2,
      name: "Отечество любимо",
      genre: "Ода",
      mainSubject: "Красотата на отечеството",
      artisticShapes: [
        "Лирически говорител",
        "Отечество",
        "Следосвобожденски човек"
      ],
    ),
    Composition(
      id: 3,
      name: "При Рилския манастир",
      genre: "Ода",
      artisticShapes: ["Лирически аз", "Природата"],
      mainSubject: "Природата - свещен хвам за душата",
    ),
    Composition(
      id: 4,
      name: "Елате ни вижте",
      genre: "Гражданска елегия",
      mainSubject:
          "Голямото разочарование от следосвобожденската действителност",
      artisticShapes: ["Лирическият аз", "Тънещите в мизерия и забрава"],
    ),
    Composition(
      id: 5,
      name: "Линее нашто поколение",
      genre: "Гражданска елегия",
      mainSubject:
          "Горчивата равносметка за изгубения възрожденски идеализъм, за покрусените надежди, че свободата ще донесе благоденствие",
      artisticShapes: [
        "Лирически говорител",
        "Лампата на Божия олтар",
        "Звездата на моряка"
      ],
    ),
    Composition(
      id: 6,
      name: 'Левски',
      genre: 'ода',
      mainSubject: 'Преклонение пред личността на Апостола.',
      artisticShapes: [
        'Почтенния проблем за човешкия избор',
        'Дългът на личността и народното страдание',
        'Новия път',
        'Мотивът за мъченичеството',
        'Мотивът за предателството'
      ],
    ),
    Composition(
        id: 7,
        name: 'Опълченците на Шипка',
        genre: 'ода',
        mainSubject: 'Величието на човешкия дух',
        artisticShapes: [
          'Националната памет',
          'Величието и падението',
          'Клеветничество срещу българите и правото им на национална гордост',
          'Славата и срамът'
        ]),
    Composition(
        id: 8,
        name: 'Чичовци',
        genre: 'Повест',
        mainSubject: 'Битието на човеците',
        artisticShapes: [
          'Варлаам Копринарката',
          'Иван Селямсъзът',
          'Хаджи Смион',
          'Иванчо Йотата',
          'Мирончо',
          'Господин Фратю',
          'Чорбаджи Мичо Байзадето'
        ]),
    Composition(
        id: 9,
        name: 'Под игото',
        genre: 'Роман',
        mainSubject: 'Сблъсъкът между бита и бунта',
        artisticShapes: [
          'Иван Краличът',
          'Соколов',
          'Рада Госпожина',
          'Чорбаджи Марко',
          'Кириак Стефчов',
          'Госпожа Хаджи Ровоама',
          'Мунчо',
          'Фратю',
          'Иван Боримечката',
        ]),
    Composition(
        id: 10,
        name: 'Дядо Йоцо гледа',
        genre: 'разказ',
        mainSubject: 'Разочарованието от следосвобожденската действителност',
        artisticShapes: [
          'Дядо Йоцо',
        ]),
    Composition(
        id: 11,
        name: 'Кочо',
        genre: 'ода',
        mainSubject: 'Саможертвената защита на Перущица от цялата общност',
        artisticShapes: ['Кочо', 'Перущица', 'Врагът']),
    Composition(
        id: 12,
        name: 'Паисий',
        genre: 'ода',
        mainSubject: 'Мъченичеството и духовният подвиг на героя',
        artisticShapes: [
          'Паисий',
          'Манастирът',
        ])
  ];
}
